manager_text = 'به منو مدیریت ربات خوش امدید لطفا یک عملیات را انتخاب کنید :'
user_not_admin  = 'شما مجاز به استفاده از ربات نیستی !'
admin_manager_text = 'مدیریت ادمین های ربات \nبرای حذف ادمین بر روی آن بزنید\nبرایه افزودن ادمین بر روی ➕ بزنید و چت ایدی کاربر مورد نظر را وارد کنید '
send_admin_chat_id = 'لطفا چت آیدی کسی که میخاهید به لیست ادمین ها اضافه شود را وارد کنید :'
error_alert = 'خطا لطفا دوباره تلاش کنید !'
add_admin = 'ادمین جدید با موفقیت افزوده شد !'
accounts_list_text = 'لیست اکانت های متصل شده به ربات \nبرای مدیریت هر اکانت بررویه شماره مورد نظر بزنید \nبرای افزودن اکانت بر روی ➕بزنید'
send_phone  = 'لطفا شماره مورد نظر را به همرا کد کشور وارد کنید مثلا اگر شماره ایران است به این شکل وارد کنید : +989123456789'
post_reveived= 'پست با موفقیت دریافت شد و در صف ارسال قرار گرفت'


def enter_password(hinit):
    return f'''
لطفا پسورد حساب خود را وارد کنید :  `{hinit}`'''

password_is_wrong = 'پسورد وارد شده اشتباه است لطفا مراحل را دوباره انجام دهید'
code_is_wrong ='کد وارد شده اشتباه است لطفا دوباره تلاش کنید'
code_is_broken = 'کد منقضی شده است لطفا کد ارسال شده از طرف تلگرام را کپی نکنید در صورت کپی کردن کد منقضی میشود'
success_login = 'اکانت با موفقیت متصل شد !'



def account_manager(phone):
    return f'مدیریت اکانت : `{phone}`'









admin_panel = 'به ادمین پنل خوش امدید'
send_phone = 'لطفا شماره مبایل اکانتی که میخاید اضافه کنید رو ارسال کنید .\n باید اول شماره + قرار بدید برای مثال : \n +98912345678'
wrong_phone = 'شماره اشتباه است لطفا دوباره تلاش کنید '
send_code = '''
کد به شماره مورد نظر ارسال شد .
لطفا اول کد خود کلمه a قرار دهید .
برای مثلا کد شما 12345 است به این شکل کد را به ربات ارسال کنید : a12345
'''

err_code_format  = 'فورمت کد وارد شده اشتباه است لطفا اول کد a قرار دهید و دوباره امتحان کنید .'
loggined = 'اکانت با موفقیت افزوده شد .'
wrong_code = 'کد وارد شده اشتباه است لطفا مجددا تلاش کنید .'
wrong_pass = 'خطا این اکانت دارای پسورد است لطفا پسورد را به درستی وارد کنید .'
plase_send_phone ='خطا لطفا از اول تلاش کنید'
err_account_not_found =f'برای فعال شدن این بخش باید حدقل یک اکانت از بخش " افزودن اکانت " به ربات اضافه کرده باشید .'
send_link_chat = 'لطفا لینگ گروهی که میخاید یوزر هاشو استخراج کنید ارسال کنید :'
send_ads = 'لطفا فایل تبلیغاتی خود را در قالب .text  ارسال کنید :'


